Revit 2027 API
BuiltInFailures.MechanicalFailures.InitialEqualFrictionSizingFailed Property
 Initial Equal Friction Sizing failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InitialEqualFrictionSizingFailed { get; }
Public Shared ReadOnly Property InitialEqualFrictionSizingFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InitialEqualFrictionSizingFailed {
	FailureDefinitionId^ get ();
}
static member InitialEqualFrictionSizingFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace